
const unosTeksta = document.body.querySelector('#unos');
const unosReci = document.body.querySelector('#unosReci');
const dugme = document.body.querySelector('#dugme');
const lista = document.body.querySelector('#ponudjeno');
const cekiraj = document.body.querySelector("#cekiraj");

const analizirajTekst = (tekst, reciFilter, teloTabele, teloTabele2, sortiraj) => {
    let slova = new Map();
    let reci = new Map();
    let ukupnoSlova = 0;


    let reciNiz = tekst.replace(/[$&+,:;=?@#|<>\.^*() %\!\-\–"]/g , ' ').replace(/[„“‘,\n]/g, " ").toLowerCase().split(' ').filter((rec) => !!rec).map((rec) => rec.trim());
    let ukupnoReci = reciNiz.length;

    for(let i = 0; i < reciNiz.length; i++) {
        let rec = reciNiz[i];

        if(reci.has(rec) == true) {
            let brojPojavljivanjaReci = reci.get(rec) + 1;
            reci.set(rec, brojPojavljivanjaReci);
        } else {
            reci.set(rec, 1); // prvo pojavljivanje
        }


        // analiziraj slova te reci
        for(let j = 0; j < rec.length; j++) {
            let slovo = rec[j];

            if(slovo === slovo.toUpperCase()) { continue; }

            ukupnoSlova++;

            if(slova.has(slovo) == true) {
                let brojPojavljivanja = slova.get(slovo) + 1;
                slova.set(slovo, brojPojavljivanja);
            } else {
                slova.set(slovo, 1); // prvo pojavljivanje
            }
        }
    }

    // popuni niz slova i sortiraj slova po ucestanosti
    let nizSlovaBrojeva = [];
    slova.forEach((broj, slovo) => {
        nizSlovaBrojeva.push({ broj, slovo });
    });


    // popuni niz reci gde se ubacuju samo one reci koje nisu bile u listi reci i sortiraj reci po ucestanosi
    let nizReciBrojeva = [];
    reciFilter = reciFilter.split(',').filter((rec) => { rec = rec.trim().toLowerCase(); return !!rec;}).map((rec) => rec.trim());

    if(reciFilter.length == 0) {
        // racunamo sve reci
        reci.forEach((broj, rec) => {
            nizReciBrojeva.push({ broj, rec });
        });

    } else {
        // postoji filter
        reciFilter = new Set(reciFilter);
        reci.forEach((broj, rec) => {

            if(reciFilter.has(rec) == true) {
                nizReciBrojeva.push({ broj, rec });
            }

        });
    }

    if(sortiraj == true) {
        nizSlovaBrojeva.sort((prvi, drugi) => drugi.broj - prvi.broj);
        nizReciBrojeva.sort((prva, druga) => druga.broj - prva.broj);
    }


    // popuni tabelu slova na stranici
    teloTabele.innerHTML = "";
    nizSlovaBrojeva.forEach((slovoBroj) => {
        let redTabele = document.createElement('tr');
        let slovoTabele = document.createElement('td');
        slovoTabele.innerText = slovoBroj.slovo;

        let brojTabele = document.createElement('td');
        brojTabele.innerText = slovoBroj.broj;

        let procenatTabele = document.createElement('td');
        procenatTabele.innerText = `${(slovoBroj.broj / ukupnoSlova) * 100}%`

        redTabele.appendChild(slovoTabele);
        redTabele.appendChild(brojTabele);
        redTabele.appendChild(procenatTabele);
        teloTabele.appendChild(redTabele);

    });

    // popuni tabelu reci na stranici
    teloTabele2.innerHTML = "";
    nizReciBrojeva.forEach((recBroj) => {
        let redTabele = document.createElement('tr');
        let recTabele = document.createElement('td');
        recTabele.innerText = recBroj.rec;

        let brojTabele = document.createElement('td');
        brojTabele.innerText = recBroj.broj;

        let procenatTabele = document.createElement('td');
        procenatTabele.innerText = `${(recBroj.broj / ukupnoReci) * 100}%`

        redTabele.appendChild(recTabele);
        redTabele.appendChild(brojTabele);
        redTabele.appendChild(procenatTabele);
        teloTabele2.appendChild(redTabele);
    })
}

const stariVujadin = `Ђевојка је своје очи клела
"Чарне очи, да би не гледале
Све гледасте, данас не виђесте
Ђе прођоше Турци Лијевњани,
Проведоше из горе хајдуке
Вујадина са обадва сина
На њима је чудно одијело
На ономе старом Вујадину,
На њем' бињиш од сувога злата,
У чем паше на диван излазе
На Милићу Вујадиновићу,
Још је на њем' љепше одијело
На Вулићу, брату Милићеву,
На глави му чекркли челенка,
Баш челенка од дванаест пера,
Свако перо од по литру злата.
Кад су били бијелу Лијевну,
Угледаше проклето Лијевно,
Ђе у њему бијели се кула
Тад говори стари Вујадине
"О синови, моји соколови,
Видите ли проклијето Лијевно,
Ђе у њему бијели се кула
Онђе ће нас бити и мучити
Пребијати и ноге и руке,
И вадити наше очи чарне
О синови, моји соколови,
Не будите срца удовичка,
Но будите срца јуначкога,
Не одајте друга ни једнога,
Не одајте ви јатаке наше
Код којих смо зиме зимовали,
Зимовали, благо остављали
Не одајте крчмарице младе,
Код којих смо рујно вино пили,
Рујно вино пили у потаји.
Кад дођоше у Лијевно равно,
Метнуше их Турци у тавницу,
Тавноваше три бијела дана,
Док су Турци вијећ' вијећали
Како ће их бити и мучити;
Кад прођоше три бијела дана,
Изведоше старог Вујадина,
Пребише му и ноге и руке;
Кад стадоше очи вадит' чарне,
Говоре му Турци Лијевњани:
"Казуј, куjо, стари Вујадине,
Казуј, куjо, дружину осталу,
И јатаке куд сте доходили,
Доходили, зиме зимовали,
Зимовали, благо остављали;
Казуј, куjо, крчмарице младе
Код којих сте рујно вино пили,
Пили рујно вино у потаји.
Ал' говори стари Вујадине:
"Не лудујте, Турци Лијевњани!
Кад не казах та те хитре ноге,
Које-но су коњма утјецале,
И не казах за јуначке руке,
Које-но су копља преламале
И на голе сабље ударале,
- Ја не казах за лажљиве очи,
Које су ме на зло наводиле,
Гледајући с највише планине,
Гледајући доље на друмове,
Куд пролазе Турци и трговци.`;

const santaMaria = `Опрости, мајко света, опрости,
што наших гора пожалих бор,
на ком се, устук свакоје злости,
блаженој теби подиже двор;
презри, небеснице, врело милости,
што ти земаљски сагреши створ:
Кајан ти љубим пречисте скуте,
Santa Maria della Salute.

Зар није лепше носит лепоту,
сводова твојих постати стуб,
него грејући светску грехоту
у пепо спалит срце и луб;
тонут о броду, трнут у плоту,
ђаволу јелу а врагу дуб?
Зар није лепше вековат у те,
Santa Maria della Salute?

Опрости, мајко, много сам страдо,
многе сам грехе покајо ја;
све што је срце снивало младо,
све је то јаве сломио ма';
за чим сам чезно, чему се надо,
све је то давно пепо и пра',
на угод живу пакости жуте,
Santa Maria della Salute.

Тровало ме је подмукло, гњило,
ал опет нећу никога клет;
шта год је муке на мене било,
да никог за то не криви свет:
Јер, што је души ломило крило,
те јој у јеку душило лет,
све је то с ове главе, са луде,
Santa Maria della Salute!

Тад моја вила преда ме грану,
лепше је овај не виде вид;
из црног мрака дивна ми свану,
ко песма славља у зорин свит;
сваку ми махом залечи рану,
ал тежој рани настаде брид:
Што ћу од миља, од муке љуте,
Santa Maria della Salute?

Она ме гледну. У душу свесну
никад још такав не сину глед;
тим би, што из тог погледа кресну,
свих васиона стопила лед,
све ми то нуди за чим год чезну',
јаде па сладе, чемер па мед,
сву своју душу, све своје жуде,
– сву вечност за те, дивни тренуте! –
Santa Maria della Salute

Зар мени јадном сва та дивота?
Зар мени благо толико све?
Зар мени старом, на дну живота,
та златна воћка што сад тек зре?
Ох, слатка воћко танталска рода,
што ниси мени сазрела пре?
Опрости моје грешне залуте,
Santa Maria della Salute.

Две се у мени побише силе,
мозак и срце, памет и сласт,
дуго су бојак страховит биле,
ко бесни олуј и стари храст;
напокон силе сусташе миле,
вијугав мозак одржа власт,
разлог и запон памети худе,
Santa Maria della Salute.

Памет ме стегну, ја срце стисну',
утекох мудро од среће, луд,
утекох од ње – а она свисну.
Помрча сунце, вечита студ,
гаснуше звезде, рај у плач бризну,
смак света наста и страшни суд –
О, светски сломе, о страшни суде,
Santa Maria della Salute!

У срцу сломљен, збуњен у глави,
спомен је њезин свети ми храм,
кад ми се она одонуд јави,
ко да се бог ми појави сам:
У души бола лед ми се крави,
кроз њу сад видим, од ње све знам
зашто се мудрачки мозгови муте,
Santa Maria della Salute.

Дође ми у сну. Не кад је зове
силних ми жеља наврели рој,
она ми дође кад њојзи гове,
тајне су силе слушкиње њој.
Навек су са њом појаве нове,
земних милина небески крој.
Тако ми до ње простире путе,
Santa Maria della Salute.

У нас је све ко у мужа и жене,
само што није брига и рад,
све су милине, ал нежежене,
страст нам се ближи у рајски хлад;
старија она сад је од мене,
тамо ћу бити доста јој млад,
где свих времена разлике ћуте,
Santa Maria della Salute.

А наша деца песме су моје,
тих састанака вечити траг,
то се не пише, то се не поје,
само што душом пробије зрак.
То разумемо само нас двоје,
то је у рају приновак драг,
то тек у заносу пророци слуте,
Santa Maria della Salute.

А кад ми дође да прсне глава
о тог живота хридовит крај,
најлепши сан ми постаће јава,
мој ропац њено: “Ево ме, нај!”
Из ништавила у славу слава,
из безњенице у рај, у рај!
У рај, у рај, у њезин загрљај!
Све ће се жеље ту да пробуде,
душине жице све да прогуде,
задивићемо светске колуте,
богове силне, камоли људе,
звездама ћемо померит путе,
сунцима засут сељенске студе,
да у све куте зоре заруде,
да од милине дуси полуде,
Santa Maria della Salute.`;

const oblakUPantalonama = `Теби, Љиљо

Мисао вашу,
што машта на омекшалом мозгу,
ко лакеј на масној софи, од сала надут,
дражићу дроњцима срца окрвављеним грозно,
сит наругавши се, безочан и љут.

Ја у души немам ниједне седе власи,
ни старачке нежности нема у њој!
Свет сам заглушио снагом свог гласа,
двадесет двогодишњак – идем,
лепотан, свој.

Нежни!
Ви љубав стављате на виолину.
На таламбасе је мећете грубе.
А не можете ко ја изврнути своју кожурину,
тако да још свуда све самих усана буде.

Дођите у кафану да се научите –
у хаљини од батиста права,
пристојна чиновница анђеоске лиге

И која усне спокојно прелистава,
ко куварица странице своје књиге
Ако хоћете,
од меса бесан ћу да режим
– и ко небо мењајући тонове –
ако хоћете,
бићу беспрекрно нежан,
не човек, већ – облак у панталонама!

Не верујем да постоји цветна Ница!
Опет се прослављају помоћу мене
људи, упарложени као болница
и, ко пословица отрцане жене.

Ви мислите, бунца маларија?
То је било,
било у Одеси.

„Доћу у четри“ – рекла је Марија
Осам.
Девет.
Десет.

Ево и вече
у ноћну страву бежи,
вече децембарско
с прозора
у магли
У старачка леђа смеју се и ржу
канделабри.

Мене више нико препознати не може.
ја сам згрчена
гомила
жила.
Шта таква гомила пожелети може?
А много хоће таква гомила

Јер више није важно
ни то што сам од бронзе,
ни то што срце моје –
од гвожђа хладног –
бије.
Ноћу и човек свој звек
у нешто женско, меко,
зажели да скрије.

И ја сам,
огроман,
на прозору савијен,
растапан стакло челом од челика
Да ли је то љубав или није?
И каква је –
мала или велика?

Одакле велика у таквом телу
мора да је то малена,
нека кротка љубав, што се у страну баца
од аутомобилских сирена
и воли звекет прапораца

Опет и опет
чекам,
забивши лице у рохаво лице кише
И већ ме је попрскала дрека
градске плиме, све више

Поноћ, са ножем ког пружа –
до ђавола са њим! –
дошла је,
заклала.

И као са пања глава сужња,
дванаесат ура је пала.
У окнима суморне кишне капи,
кревељећи се,
накрцале,
ко урлањем уста да су разјапиле
химере са париске катедрале.

Проклета да си!

И поцепа уста скоро крик
Зар ти је и то мало?
Чујем:
нерв,
тихо, као са кревета болесник,
подигао се
И, гле –

у почетку је пошао
једва,
онда је усталасан,
јасан,
потрчао.
Сада је са друга два
очајно играти стао
Пао је плафон на спрату ниже.

Живци
велики,
мали,
многи –
помамно скачу
и већ –
гмижу.
Живци спали с ногу!
А ноћ се по соби глиби и око,
отежало, одатле никако да се исправи.

Одједном, врата зацвилише, ко
да крчма зуб на зуб
не може да састави.

Ушла си
осорна, као „на!“
гужвајући рукавице као луда
и рекла: „Да,
знате, ја ћу да се удам.“

Па шта, удајте се.
Ништа није било.
Издржаћу.
Гледајте – ја сам спокојан ко
било
покојника.

Сећате се?

Говорили сте:
„Џек Лондон,
новац,
љубав,
страсти“ –
а ја видјех једно:
ви сте Ђоконда,
коју треба украсти!

И украли су је.

Опет ћу љубав у теревенкама утући
повије обрва озаривши ватром.
Па шта!
Понекад и у изгорелој кући
скитнице нађу дом!

Изазивате?

„Мање но просјак копејака
ви имате смарагда безумља.“
Сетите се!
Пала је Помпеја
од раздраженог Везува!

Хеј!
Господо!
Љубитељи
обесвећења,
злочинства,
покоља,
да ли сте најстрашније
видели –
лице моје
када сам
ја
апсолутно спокојан?
И осећам –
„ја“
за мене је мало.
Неко се отима из утробе моје

Хало!
Ко је?
Мама?
Вашег сина нешто дивно боли!
Мама!
Запаљено му је срце и вене
Реците сестрама, Људи и Ољи,
он нема куда да се дене
Свака реч,
чак и шала штура,
коју избљују његове усне горуће
излеће као гола курва
из запаљене јавне куће.

Људи миришу –
печења има!

Стигли су некакве
Блистави!
Под шлемовима
ено!
Не може се у чизмама!
Реците ватрогасцима
да се нежније веру по срцу запаљеном.

Сам ћу, знајте!
Избечићу сузне као бурад очи.
О ребра ми, да се опрем, дајте.
Искочићу! Искочићу! Искочићу! Искочићу!
Сурвава се и пуца.
Искочити нећеш из срца!
Из пукотине усана
на спаљеном лицу огуљеном
израсте парче пољупца изгорела.
Мама!
Да певам не могу!
Гори срца мог капела!

Поцрнеле су фигуре речи и бројева
из лобање,
ко деца из запаљеног здања.
Тако је страх, хватајућ се
за небо,
дизао
горуће руке „Лезитаније“.

Према гомили
што у тишини станова дрхти
стооки са пристаништа диже се сјај.
Криче последњи –
бар ти!
јецај, да горим, вековима дај!

Мене славите!
Ја нисам велик. Пишем
„нихил“ над свим
у овом часу.

Никада
ништа нећу да читам више.
Књиге,
Шта су?

Раније мишљах,
књиге се праве овако:
дође песник
и одмах запева колико волите,
расклопивши уста лако –
изволите!
А у ствари –
у грудима му се мрви кључа
док не запева, и док се копрца
глупава риба надахнућа,
тихо, у жабокречини срца.

И док се кува уз шкрипу рима,
од љубави и славуја папазјанија док се ствара.
улица се грчи и увија нема –
јер нема чим да викне, разговара
Вавилонске куле градова
зидаћемо опет немилице
а бог,
мешајућ речи снова,
претвараће их
у оранице.

Улица је ћутећи муку на себе вукла
Крик је стрчао из душе.
Кочоперили су се у тесноћи грла,
задригли таксији и кочије мршаве
Изгазили су груди.
Од туберкулозе горе.

Град мраком закључа двер ту

И кад –
најзад! –
на трг испљуну море
одгурнувши наваљену на грло паперту,

мислио се:
у хоровима анђеоских хорала
бог, опљачкан, иде да кажњава, да се дере!

А улица је чучнула и заурлала:
„Хајде да се ждере!“

Круп и Крупчић око града се шуља,
претећ се мршти,
а у устима још
крај распаднутих умрлих речи
само две дебљају –
„хуља“
и некаква,
чини ми се – „боршч“

Песници,
расквашени од плача што јечи,
побегли су са улица, с умршеном косом
„Како опевати са две такве речи
и девојку,
и љубав,
и цветић под росом?“

А за песницима –
улична руља:
студенти,
проститутке,
предузетници.

Господо!
Зауставите се!
Ви нисте гоље,
ви не смете да просите по улици!

Ми, снажни,
с кораком од хвата,
не смемо да их слушамо, већ рушимо
њих, које,
као бесплатни додатак,
упија сваки кревет за двоје!

Њих скрушено зар молити:
„Помози ми!“
Око химне,
за ораторијум.
Ми само смо творци пламених химни –
хуке фабрике и лабараторија.

Шта се мене тиче Фауст,
који се у оргији чаробној
с Мефистом тоциља низ небеске паркете!

Ја знам –
сваки ексер у чизми мојој
страшнији је од маште Гетеове!

Ја,
најзлатоустији,
чија свака реч тешка
душу васкрсава,
тело рукотвори,
кажем: више вреди
живота најмања комадешка
од свега што сам створио и што ћу да створим!
Слушајте!
Проповеда
јецајима и крицима
данашњих дана Заратуста!

Ми!
мамурношаршавним лицима,
с уснама обешеним као лустер,
ми,
затвореници града за губаве,
где је злато и ђубре губаве створило ране –
чистији смо од неба венецијанске плавети,
сунцима и морима опране!

Брига ме што
код Хомера и Овидија
нема људи, као ми,
сраслих у чађне богиње.
Знам –
сунце би се помрачило да види
наших душа златно изобиље!

Жиле и мишићи од молитава су јачи
Зар да тражимо милост од овог века!

Ми –
сваки –
у својој шаци
држимо трансмисије света!

То је подигло на Голготу аудиторије
у Петрограду, Кијеву, Одеси и Москви,
и није ниједног било
који је
прећутао да заурла:
„Распни га
распни!“

Но и ви –
људи
што сте ме увредили –
од свега сте ми дражи и ближи

Да ли сте видели
пас како руку што га туче лиже?!

Ја,
исмејан од данашњег племена
као непристојна анегдота
које се свако стиди,
видим онога који кроз планине времена
корача, а кога нико не види.

Тамо где не сеже око што кусо је,
на челу гладних хорди,
под трновитим венцем револуције
шеснаеста година ходи.

Међ вама – њен сам претеча;
и свуда где је бол – ја сам цео;
на свакој капи сузе сам ја
себе на крсту разапео.

Више се ништа простити не може.
Ја исцедих душе с много нежног биља.
То је – да знате – теже
него заузети милион Бастља!

И када
долазак њен
буном оглашен буде,
и одете спаситељу –
ја ћу вам
душу своју ишчупану
изгазити,
тако велика да буде! –
и окрвављену, као заставу да дам.

О, зашто,
због чега
по сјају веселом
прљавим песницама!
Дошла је,
и главу повезала,
мисао о лудницама,

И –
ко што се у бродолому
бацају, уз урлик,
људи кроз разјапљено окно –
скочио је избезумљени Бурљук
кроз своје до крика
раздерано око

Скоро окрвавивши капке сузне,
дигао се,
изашао је,
и с нежношћу, неочекиваном од дебелог човека
узе
да каже

„Добро је“
Добро је кад је од разних погледа
(да се не примети ништа)
душа у жуту блузу скривена!
Добро је
кад човек бачен у зубе губилишта
врисне: „Пијте какао Ван Хутена!“

А тај тренутак,
праскав,
што груну,
ја не бих заменио ни за шта,
ја ни..

А из дуванског дима
ко чашица рума,
протегну се алкохоличарско лице – Сјеверјањин.

Ви, што као препелице цвркућете с неба,
како вас није срамота прогласити се за поету!
Кад данас
тољагом
треба
кројити лобању свету!

Ви
што само мислите:
„лепо ли играм?“,
и о томе се старате,
гледајте како се ја забављам –
макро
који на картама вара!

Од вас,
од љубакања мокрих,
чије столећима
сузе су лиле током,
отићи ћу,
а као монокл
ставићу сунце у раскречено око.

Навукавши најчудније одело на себе,
да се свидим и спалим,
поћи ћу светом,
а на ланцу ћу испред себе
Наполеона водити као псето.

Цела земља на жену похотљиву личи,
која се врпољи жељна љубакања,
и чије усне
врскајући
криче:
„Цакани, цакани, цакани!“

Одједном,
облаци
и паперје маглено цело
размаха се до последњег небеског окрајка,
ка да се разилазе радници бели
после небесима објављеног штрајка.

Гром изби из неког облачног кутка,
шмрчући пркосно огромним носом,
и лице неба се тог тренутка
искривило у Бизмаркову гримасу.

И неко,
заплевши се у облачним негвама,
протегао руке – у кафе.
Ко да је нежан,
ко да је дама,
ко да је топовски лафет

Ви мислите –
да то нежно сунце
лупка у образе бифе?
То опет побуњене и бегунце
води на стрељање генерал Галифе!

Вадите, шетачи, из џепова руке –
потегните бомбом, каменом ил’ камом,
а ако неко нема руке –
нек дође да се туче главом!

Дођите, гладни,
покорни,
тужне прилике,
напустите вашљиве јазбине!
Дођите!
Понедељнике и уторнике
префарбаћемо крвљу у празнике!

Нека се земља под ножевима сети
кога је хтела да упропасти!
Земља –
Ротшилдова љубавница сита
и задригла од масти!

Да се у куршума киши
заставе као и празником вију
Бандере, дижите више
лешеве брашнара свију

Псујући
и преклињући,
клао је и резао,
и пузио, неког
да угризе, сутон.

На небу, црвен као марсељеза
липсавајући, дрхтао је он
Већ лудило

Ништа неће да буде

Ноћ ће да дође,
поједе,
прегризе.

Видиш ли –
небо опет нуди
прегршт испрсканих звезда од издаје.

Дошла је.
Као Мамај оргија,
обесно над град насев.
Ту ноћ пробости не могу ни ја
очима, црну као Азеф.

Јежим се, забачен у кафанском углу,
вином поливам и чаршав и душу,
и видим:
у углу очи округле,
очима срце Богородица њуши.

Зашто даривате сјајем по нацртаном шаблону
оне што се по крчмама бекеље!
Видиш –
Вараву опет воле они
више но попљуване спаситеље.

Намерно у људској мећи
можда
ни од ког нисам новији ја.
Ја сам
најлепши,
можда,
од свих твојих синова.

Дај им,
буђавим у радости,
скору смрт времена им донеси,
да постану деца што треба да одрасту
дечаци-очеви,
девојчице да занесу

И дај нека новорођен обрасте
седином радозналих врачева,
и доћи ће они –
децу да крсте
именима мојих стихова.

Ја, којисам машину и Енглеску опевао,
можда сам, напросто,
најобичнијег јеванђеља постао
тринаести апостол.

И кад од мог безобразног гласа
дан и ноћ
бубње
можда њуши
Исус Христос баш тога часа
незаборавке моје душе.

Марија! Марија! Марија!
Пусти ме, Марија!
не могу остати на улицама!

Нећеш?

Чекаш
док упалих образа грубо,
бљутав,
и испробан на свему лошем,
дођем
и процедим безубо
да сам ја данас
„необично поштен“

Марија
видиш –
ја се, већ погурен, сламам.
Гомила што је
у четвороспратним гушама сало дубила,
истурајући очице,
изгубљене у дугом трагању –
смеје се
што је ипак
међу мојим зубима
остало бајатих мрва бивших драгања.

Киша ислака тротоаре,
барама стешњена мокра варалица,
леш улица,
забијен у калдрму, лиже,
а на сивим трепавицама –
да! –
олука пуних кише

Све пешаке губица кише је посисала,
а у каруцама блешти за атлетом атлета.
прскаваху људи
проћердавши све,
и кроз пукотине се цедило сало,
ко мутна река са кочијама отицало
скупа са исисаним хлебом
и жвакотинама
старих котлета.

Марија!
Како у дебело ухо забости нежну реч?
Птица
живи од песме,
пева
гладна и звонка,
а ја сам човек, Марија,
Прост,
кога је сипљива ноћ искашљала на прљаву руку Пресње

Марија, хоћеш ли ме таквог?
Пусти ме, Марија!
Згрченим прстима давим гвоздено грло звонца

Марија!
На улицама су звери.
На врату прсти дављења што боде.
Боли!
Отвори своје двери!
Видиш –
забили су у очи из шешира чиоде.

Пусти ме
Мала!
Не бој се
што на мом воловском врату
седе као планине влажне жене од зноја губаве
Ја кроз живот вучем (и то је зато)
милион огромних, чистих љубави
и милион милиона малих љубави.

Не бој се
да ћу се опет прилепити за хиљаду лица –
„девојке Мајаковског“ –
у издајничко време мрака
та то је ипак
династија царица
крунисаних у срцу једног лудака

Марија, приђи!
У бестидности наготе,
или пуна плашљивих дрхтаја,
но дај твојих усана лепоту што још исцвала није
срце и ја ниједном не доживесмо маја,
а у проклетом животу
тек стоти април је.

Марија!
Песник сонете пева Тијани,
а ја –
цео човек
сав од меса,
тело своје просто молим,
као што хришчани:
„хлеб нам насушни
дажд нам днес“

Марија, дај!
Марија!
Име твоје бојим се да не заборавим,
као што се песник боји да не заборави
некакву тек рођену
у мукама ноћи
величином једнаку богу.

Тело твоје
чуваћу и волети
као што војник осакаћен,
без моћи,
излишан,
ничији,
чува своју јединицу ногу

Марија –
нећеш?

Нећеш?
Ха!

Значи – опет,
док мрачно је све то
узећу срце,
исплакано грозно
да га носим
ко што
у штенару псето
носи своју шапу пресечену возом

Крвљу свога срца ја радујем пут
за одећу белу лепи се прашине цвеће
Око земље-Крститељеве главе
по хиљадити пут
Иродијада-сунце ће да се окреће

И када моја гомила година
одигра своје до конца –
крвљу означиће се пут што води
ка дому мога оца.

Изаћи ћу
прљав (од јендека, где проводих ноћи),
примаћи ћу му се ближе,
сагнућу се
и на ухо му рећи:
Слушајте господине Боже!

Како вам не досади
у желе облака мрешкавих
замакати очи одебљале, а?

Хајде да организујемо
вртешку
на дрвету познавања добра и зла!
Свеприсутни, бићеш у орману сваком,
а таква ћемо вина поређати по столу
да ће се чак прохтети заиграти ки-ка-пу
и намрштеном Петру апостолу.
А у рају ћемо опет населити Евице:
нареди –
и ја ћу још ноћас
са свих булевара најлепше девице
довести теби.
Хоћеш?

Нећеш?
Вртиш главом ти, брадати?
Мрштиш седину веђа?
Ти мислиш –
зна шта је
љубав тај крилати,
иза твојих леђа?

И ја сам анђео, бејах то бар –
гледах у очи – јагње од шећера,
али ни кобиле добијати на дар
вазе од севрног брашна више неће.

Свемогући, ти си измислио
за сваког по две руке,
и свакоме си по главу дао ти –
а зашто ниси измислио
да се без муке
може љубити, љубити, љубити?!

Мишљах – божанство си, свемогуће, старо,
а ти си недоучени, мајушни богић само.
Видиш, ја се сагињем
и из саре
вадим каму

Крилати ниткови!
У рају да сте збијени!
Гомила перјаша од страха ваља се!
А тебе, што си тамјаном опијен,
распорићу одавде до Аљаске!

Пустите ме!

Нећете ме зауставити,
лажем ли, у праву ли
сам ја,
али више не могу да будем спокојан.

Гледајте –
звезде су опет обезглавили
и небо окрвавили од покоља!

Ехеј!
Небо!
Скини капу!
Ја долазим!

Глухо

Васиона спава,
положивши шапу
с крпељима звезда под огромно ухо.`;

const hasanaginica = `Шта се б'јели у гори зеленој?
Ал' је снијег, ал' су лабудови?
Да је снијег, већ би окопнио,
лабудови већ би полетјели.
Нит' је снијег нит' су лабудови,
него шатор аге Хасан-аге;
он болује од љутијех рана.
Облази га мати и сестрица,
а љубовца од стида не могла.

Кад ли му је ранам' боље било,
он поручи вјерној љуби својој:
„Не чекај ме у двору бјелому,
ни у двору, ни у роду мому“.
Кад кадуна рјечи разумјела,
још је јадна у тој мисли стала,
јека стаде коња око двора;
тад побјеже Хасанагиница
да врат ломи кули низ пенџере;
за њом трче дв'је ћере дјевојке:
„Врати нем се, мила мајко наша!
Није ово бабо Хасан-ага,
већ даиџа Пинторовић беже“.
И врати се Хасанагиница,
тер се вјеша брату око врата:
„Да, мој брате, велике срамоте,
гдје ме шаље од петоро дјеце!“
Беже мучи, ништа не говори,
већ се маша у џепе свионе
и вади јој књигу опрошћења,
да гре с њиме мајци унатраге.
Кад кадуна књигу проучила,
два је сина у чело љубила,
и дв'је ћере у румена лица,
а с малахним у бешици синком
одјелит се никако не могла;
већ је братац под руке узео
и једва је с синком раставио,
тер је меће к себи на коњица,
с њоме греде двору бијелому.

У роду је мало врјеме стала,
мало врјеме, ни недељу дана.
Добра када и од рода добра,
добру каду просе са свих страна,
а највише имотски кадија.
Кадуна се брату своме моли:
„Ај тако те не желила, брацо,
немој мене дават ни за кога,
да не пуца јадно срце моје
гледајући сиротице своје“.
Али беже ништа не хајаше,
већ њу даје имотском кадији.
Још кадуна брату се мољаше
да напише листак бјеле књиге,
да је шаље имотском кадији:
„Дјевојка те лјепо поздрављаше,
а у књизи лјепо те мољаше:
кад покупиш господу сватове,
и кад пођеш њеном бјелу двору,
дуг покривач носи на дјевојку,
када буде аги мимо двора,
да не види сиротице своје“.
Кад кадији бјела књига дође,
господу је свате покупио,
свате купи, греде по дјевојку.
Добро свати дошли до дјевојке,
и здраво се повратили с њоме;
а кад били аги мимо двора,
двје је ћерце с пенџера гледаху,
а два сина пред њу исхођаху,
тере својој мајци говораху:
„Сврати нам се, мила мајко наша,
да ми тебе ужинати дамо“.
Кад то чула Хасанагиница,
старјешини свата говорила:
„Богом брате, свата старјешина,
устави ми коње уза двора
да дарујем сиротице моје“.
Уставише коње уза двора.
Своју дјецу лјепо даровала:
сваком сину ноже позлаћене,
свакој ћери чоху од пољане,
а малому у бешици синку,
њему шаље у бошци хаљине.
А то гледа јунак Хасан-ага,
пак дозивље до два сина своја:
„Ход'те амо, сиротице моје,
кад се неће смиловати на вас
мајка ваша срца каменога“.
Кад то чула хасанагиница,
б‘јелим лицем у земљу уд'рила,
успут се је с душом раставила
од жалости гледајућ' сироте.`;

const zidanjeSkadra = `Град градила три брата рођена,
До три брата, три Мрњавчевића:
Једно бјеше Вукашине краље,
Друго бјеше Угљеша војвода,
Треће бјеше Мрњавчевић Гојко;
Град градили Скадар на Бојани,
Град градили три године дана,
Три године са триста мајстора;
Не могаше темељ подигнути,
А камоли саградити града:
Што мајстори за дан га саграде,
То све вила за ноћ обаљује.
Кад настала година четврта,
Тада виче са планине вила:
"Не мучи се, Вукашине краље,
Не мучи се и не харчи блага!
Не мож, краље, темељ подигнути,
А камоли саградити града,
Док не нађеш два слична имена,
Док не нађеш Стоју и Стојана,
А обоје брата и сестрицу,
Да зазиђеш кули у темеља:
Тако ће се темељ обдржати,
И тако ћеш саградити града."
Кад то зачу Вукашине краље,
Он дозива слугу Десимира:
"Десимире, моје чедо драго,
Досад си ми био вјерна слуга,
А одсаде моје чедо драго!
Хватај, сине, коње у хинтове,
И понеси шест товара блага;
Иди, сине, преко б'јела св'јета,
Те ти тражи, сине, Стоју и Стојана,
А обоје брата и сестрицу;
Ја ли отми, ја л' за благо купи,
Доведи их Скадру на Бојану,
Да зиђемо кули у темеља,
Не би л' нам се темељ обдржао,
И не би ли саградили града."
Кад то зачу слуга Десимире,
Он ухвати коње у хинтове,
И понесе шест товара блага;
Оде слуга преко б'јела св'јета,
Оде тражит' два слична имена:
Тражи слугу Стоју и Стојана,
Тражи слуга три године дана,
Ал' не нађе два слична имена,
Ал' не нађе Стоје и Стојана,
Па се врну Скадру на Бојану,
Даде краљу коње и хинтове,
И даде му шест товара блага:
Ја не нађох два слична имена,
Ја не нађох Стоје и Стојана."
Кад то зачу Вукашине краљу,
Он подвикну Рада неимара,
Раде викну три стотин' мајстора:
Гради краље Скадар на Бојани,
Краље гради, вила обаљује,
- Не да вила темељ подигнути,
А камоли саградити града!
Па дозивље из планине вила:
"Море, чу ли, Вукашине краљу,
Не мучи се и не харчи блага!
Но ето сте три брата рођена,
У свакога има вјерна љуба;
Чија сјутра на Бојану дође
И донесе мајсторима ручак,
Зиђите је кули у темеља:
Тако ће се темељ обдржати,
Тако ћете саградити града."
Кад то зачу Вукашине краљу,
Он дозива два брата рођена:
"Чујете ли, моја браћо драга,
Ето вила са планине виче,
Није вајде што харчимо благо,
Не да вила темељ подигнути,
А камоли саградити града!
Још говори са планине вила:
Ев' ми јесмо три брата рођена,
У свакога има вјерна љуба;
Чија сјутра на Бојану дође
И донесе мајсторима ручак,
Да ј' у темељ кули узидамо:
Тако ће се темељ обдржати,
Тако ћемо саградити града.
Но је л', браћо, Божја вјера тврда
Да ниједан љуби не докаже,
Већ на срећу да им оставимо,
Која сјутра на Бојану дође?"
И ту Божју вјеру зададоше
Да ниједан љуби не докаже.
У том их је ноћца застанула,
Отидоше у бијеле дворе,
Вечераше господску вечеру.
Ал' да видиш чуда великога!
Краљ Вукашин вјеру погазио,
Те он први својој љуби каза:
"Да се чуваш, моја вјерна љубо!
Немој сјутра на Бојану доћи,
Ни донијет' ручак мајсторима,
Јер ћеш своју изгубити главу,
Зидаће те кули у темеља!"
И Угљеша вјеру погазио,
И он каза својој вјерној љуби:
"Не превар' се вјерна моја љубо!
Немој сјутра на Бојану доћи,
Ни донијет' мајсторима ручак,
Јера хоћеш млада погинути,
Зидаће те кули у темеља!"
Млади Гојко вјеру не погази,
И он својој љуби не доказа.
Кад ујутру јутро освануло,
Поранише три Мрњавчевића,
Отидоше на град на Бојану.
Земан дође да се носи ручак,
А редак је госпођи краљици.
Она оде својој јетрвици,
Јетрвици, љуби Угљешиној:
"Чу ли мене, моја јетрвице!
Нешто ме је забољела глава,
Тебе здравље, пребољет' не могу;
Но понеси мајсторима ручак."
Говорила љуба Угљешина:
"О, јетрво, госпођо краљице!
Нешто мене забољела рука,
Тебе здравље, пребољет' не могу;
Већ ти збори млађој јетрвици."
Она оде млађој јетрвици:
"Јетрвице, млада Гојковице!
Нешто ме је забољела глава,
Тебе здравље, пребољет' не могу;
Но понеси мајсторима ручак."
Ал' говори Гојковица млада:
"Чу ли, нано, госпођо краљице!
Ја сам рада тебе послушати,
Но ми лудо чедо некупато,
А бијело платно неиспрато."
Вели њојзи госпођа краљица:
"Иди", каже, "моја јетрвице,
Те однеси мајсторима ручак,
Ја ћу твоје изапрати платно,
А јетрва чедо окупати."
Нема шта ће Гојковица млада,
Већ понесе мајсторима ручак.
Кад је била на воду Бојану,
Угледа је Мрњавчевић Гојко;
Јунаку се срце ражалило,
Жао му је љубе вијернице,
Жао му је чеда у колијевци,
Ђе остаде од мјесеца дана;
Па од лица сузе просипаше.
Угледа га танана невјеста,
Кротко ходи, док до њега приђе:
"Што је тебе, добри господару,
Те ти рониш сузе од образа?"
Ал' говори Мрњавчевић Гојко:
"Зло је моја вијернице љубо!
Имао сам од злата јабуку,
Па ми данас паде у Бојану,
Те је жалим, прегорет' не могу!"
Не сјећа се танана невјеста,
Но бесједи своме господару:
"Моли Бога ти за твоје здравље,
А салићеш и бољу јабуку!"
Тад јунаку грђе жао било,
Па на страну одвратио главу,
Не шће више ни гледати љубу;
А дођоше два Мрњавчевића,
Два ђевера Гојковице младе,
Узеше је за бијеле руке,
Поведоше у град да уграде,
Подвикнуше Рада неимара,
Раде викну до триста мајстора;
Ал' се смије танана невјеста,
Она мисли да је шале ради.
Турише је у град уграђиват';
Оборише до триста мајстора,
Оборише дрвље и камење,
Узидаше дори до кољена:
Још се смије танана невјеста,
Још се нада да је шале ради;
Оборише до триста мајстора,
Оборише дрвље и камење,
Узидаше дори до појаса:
Тад отежа дрвље и камење;
Онда виђе шта је јадну нађе,
Љуто писну како љута гуја,
Па замоли два мила ђевера:
"Не дајте ме младу и зелену!"
То се моли, ал' јој не помаже,
Јер ђевери у њу и не гледе.
Тад се прође срама и зазора,
Паке моли свога господара:
"Не дај мене, добри господару,
Да ме младу у град узидају!
Но ти прати мојој старој мајци:
Моја мајка има доста блага,
Нек ти купи роба ил' робињу.
Те зидајте кули у темеља."
То се моли, но јој не помаже.
А кад виђе танана невјеста
Да јој више молба не помаже,
Тад се моли Раду неимару:
"Богом брате, Раде неимаре,
Остави ми прозор на дојкама,
Истури ми моје б'јеле дојке,
Када дође, мој нејаки Јово,
Када дође, да подоји дојке!"
То је Раде за братство примио,
Остави јој прозор на дојкама,
Па јој дојке упоље истури,
Када дође нејаки Јоване,
Када дође, да подоји дојке.
Опет тужна, Рада дозивала:
"Богом брате, Раде неимаре,
Остави ми прозор на очима,
Да ја гледам ка бијелу двору
Кад ће мене Јова доносити
И ка дворy опет односити."
И то Раде за братство примио,
Остави јој прозор на очима,
Те да гледа ка бијелу двору
Каде ће јој Јова доносити
И ка двору опет односити.
И тако је у град уградише,
Па доносе чедо у кол'јевци,
Те га доји за неђељу дана,
По неђељи изгубила гласа;
Ал' ђетету онђе иде храна:
Дојише га за годину дана,
Како таде, тако и остаде,
Да и данас онђе иде храна:
Зарад' чуда и зарад' лијека,
Која жена не има млијека.`;

const dela = [
    { naslov: "Одаберите дело", delo: "" },
    { naslov: 'Стари Вујадин', delo: stariVujadin },
    { naslov: 'Santa Maria della Salute', delo: santaMaria },
    { naslov: 'Облак у панталонама', delo: oblakUPantalonama },
    { naslov: 'Хасанагиница', delo: hasanaginica },
    { naslov: 'Зидање Скадра', delo: zidanjeSkadra }
];

if(lista) {

    for(let i = 0; i < dela.length; i++) {

        let opcija = document.createElement('option');
        opcija.text = dela[i].naslov;
        lista.appendChild(opcija);
    }

    lista.onchange = (e) => {
        unosTeksta.innerHTML = dela[e.target.selectedIndex].delo;
    }
}

if(unosTeksta) {
    unosTeksta.onkeydown = (e) => {
        let ctrl = e.ctrlKey;
        let taster = e.key;

        if(ctrl == true && taster == 'Enter') {

            const teloTabele = document.body.querySelector('#rezultat');
            const teloTabele2 = document.body.querySelector('#rezultatReci');
            if(!teloTabele || !teloTabele2) { return; }

            analizirajTekst(unosTeksta.value, unosReci.value, teloTabele, teloTabele2, cekiraj.checked);

        }

    };

    if(dugme) {
        dugme.onclick = (e) => {
            const teloTabele = document.body.querySelector('#rezultat');
            const teloTabele2 = document.body.querySelector('#rezultatReci');
            if(!teloTabele || !teloTabele2) { return; }

            analizirajTekst(unosTeksta.value, unosReci.value, teloTabele, teloTabele2, cekiraj.checked);
        }
    }
}





